import { createStore, mapActions } from 'vuex'

export const store = createStore({
    state() {
        return {
            // 首页的栏子
            mana: [
                {   
                    id:1,
                    icon:"el-icon-icon-test",
                    color:"#8a2be2",
                    title:"最新博文",
                    span:6,
                    note: [
                        {
                            id:1,
                            image:"src/assets/4.jpg",
                            word:"摸鱼第一名！"
                        },
                        {
                            id:2,
                            image:"src/assets/4.jpg",
                            word:"摸鱼第一名！"
                        },
                        {
                            id:3,
                            image:"src/assets/4.jpg",
                            word:"摸鱼第一名！"
                        },
                        {
                            id:4,
                            image:"src/assets/7bd3d3b95165c47a86b95cd5c3734d48.png",
                            word:"摸鱼第一名！"
                        },
                    ]  
                },
                {   
                    id:2,
                    icon:"el-icon-icon-test1",
                    color:"skyblue",
                    title:"最新视频",
                    span:6,
                    note: [
                        {
                            id:1,
                            image:"src/assets/4.jpg",
                            word:"摸鱼第一名！"
                        },
                        {
                            id:2,
                            image:"src/assets/4.jpg",
                            word:"摸鱼第一名！"
                        },
                        {
                            id:3,
                            image:"src/assets/4.jpg",
                            word:"摸鱼第一名！"
                        },
                        {
                            id:4,
                            image:"src/assets/7bd3d3b95165c47a86b95cd5c3734d48.png",
                            word:"摸鱼第一名！"
                        },
                    ]  
                },
                {  
                    id:3,
                    icon:"el-icon-icon-test2",
                    color:"pink",
                    title:"最新图片",
                    span:6,
                    note: [
                        {
                            id:1,
                            image:"src/assets/4.jpg",
                            word:"摸鱼第一名！"
                        },
                        {
                            id:2,
                            image:"src/assets/4.jpg",
                            word:"摸鱼第一名！"
                        },
                        {
                            id:3,
                            image:"src/assets/4.jpg",
                            word:"摸鱼第一名！"
                        },
                        {
                            id:4,
                            image:"src/assets/7bd3d3b95165c47a86b95cd5c3734d48.png",
                            word:"摸鱼第一名！"
                        },
                        
                    ]  
                },
                {  
                    id:4,
                    icon:"el-icon-zuopinzhuzuo",
                    color:"gray",
                    title:"最新作品",
                    span:4,
                    note: [
                        {
                            id:1,
                            image:"src/assets/4.jpg",
                            word:"摸鱼第一名！"
                        },
                        {
                            id:2,
                            image:"src/assets/4.jpg",
                            word:"摸鱼第一名！"
                        },
                        {
                            id:3,
                            image:"src/assets/4.jpg",
                            word:"摸鱼第一名！"
                        },
                        {
                            id:4,
                            image:"src/assets/7bd3d3b95165c47a86b95cd5c3734d48.png",
                            word:"摸鱼第一名！"
                        },
                        {
                            id:5,
                            image:"src/assets/7bd3d3b95165c47a86b95cd5c3734d48.png",
                            word:"摸鱼第一名！"
                        },
                        {
                            id:6,
                            image:"src/assets/7bd3d3b95165c47a86b95cd5c3734d48.png",
                            word:"摸鱼第一名！"
                        },
                    ]  
                },
              ],
            // 笔记部分的日记
         article:[
    // 2022
            {
            year:'2022',
            diary:[{
               id:1,
               head:"さくら、もゆ",
               content:["真夏の夜の荒地に在盛夏之夜的荒凉地方紅い炎燃え盛る一朵鲜红的火焰熊熊绽放薄絹を身に細い足首划过的数量運命の行方占う可以占卜命运行进的方向白い肌に走るは在白皙的肌肤上游荡火のトカゲの紅い舌火に闪闪的饰物纤足缀金のアンクレット金光照亮了漆黑的夜晚月の光が満ちる皎洁的月光来相会妖精は羽を交わし歌うよ伴唱的妖精在舞步中 把羽翼交汇炎焦れて捕まえる世界ごと就让火焰燃烧 连同我与这被捕获的世界そして逃げられぬ 彼の腕到最后没办法逃脱 他的手腕情熱で焼け付く被他的热情 燃烧殆尽甘やかな囁き一つ一抹甜言蜜语产生的效果穢れ無き少女には毒对纯情少女来说无异于毒惑戸惑い抗うだけ不甘困惑随之作出的抗争憂いそして逃げられ",
               "ぬ 彼の腕到最后没办法逃脱 他的手腕情熱で焼け付く被他的热情 燃烧殆尽に満ち輝く却因此心里被忧伤充盈髪を靡かせて柔顺的秀发随风飘細い手で凪いで纤细的玉手捋发梢しなやかに舞い踊り轻盈地跃动 灵快地舞蹈鈴を鳴らし揺れる脚踝上的银铃作响轻摇妖精は哀を食んで歌うよ伴舞的妖精在歌唱 把哀伤都吃掉炎蒔いて 笑み浮かべる播撒下了火种 脸上浮现微笑長い睫毛 伏せ长长的睫毛齐低垂細い足首に闪闪的饰物纤足缀金のアンクレット金光照亮了漆黑的夜晚月の光が満ちる皎洁的月光来相会妖精は羽を交わし歌うよ伴唱的妖精在舞步中 把羽翼交汇炎焦れて捕まえる世界ごと就让火焰燃烧 连同我与这被捕获的世界",
               "真夏の夜の荒地に在盛夏之夜的荒凉地方紅い炎燃え盛る一朵鲜红的火焰熊熊绽放薄絹を身に纏い轻盈的薄绢盘绕于精在歌唱 把哀伤都吃掉炎蒔いて 導いて彼方へと播撒焰种 其的方向 向远方引导熱く惹かれあう 纏い轻盈的薄绢盘绕于身上祈りを捧げる少女虔诚的少女用灵魂在祈望願いは戦場へと那愿望是にはいらない其他的事 不曾奢望涙を届けて欲しい只想要让泪水传达给神明髪を靡かせて柔顺的 征战沙场的他旅立つ彼の無事を旅程一切顺利人安康他秀发随风飘細い手で凪いで纤细的玉手捋发梢しなやかに舞い踊り轻盈地跃动 灵快地舞蹈鈴を鳴らし 揺れる脚踝上的银铃作响轻摇妖精は哀を食んで歌うよ伴舞的妖彼の手へ炽热的吸引两人双手相交もう一度 逢わせて就希望再次 重回怀抱流れた星を数え用心数流星蜥蜴的红舌仿佛在流淌少女へ恋に堕ちた 炎統べる王は言う坠入爱河 的少女尝试去 祈求火炎之王的威光我が為 踊れば 望みを聞き届けよう王对她说 “所有愿望 你的一舞便可以全部抵偿”長い睫毛 伏せ长长的睫毛齐低垂"
           ],
               weather:"el-icon-xiaoxue",
               weather_detail:"雪",
               mood:"el-icon-kaixin",
               mood_detail:"开心",
               like:0
           },
           
            ]
        },

    //   2021
            {
            year:'2021',
            diary:[{
               id:1,
               head:"",
               content:["真夏の夜の荒地に在盛夏之夜的荒凉地方紅い炎燃え盛る一朵鲜红的火焰熊熊绽放薄絹を身に細い足首划过的数量運命の行方占う可以占卜命运行进的方向白い肌に走るは在白皙的肌肤上游荡火のトカゲの紅い舌火に闪闪的饰物纤足缀金のアンクレット金光照亮了漆黑的夜晚月の光が満ちる皎洁的月光来相会妖精は羽を交わし歌うよ伴唱的妖精在舞步中 把羽翼交汇炎焦れて捕まえる世界ごと就让火焰燃烧 连同我与这被捕获的世界そして逃げられぬ 彼の腕到最后没办法逃脱 他的手腕情熱で焼け付く被他的热情 燃烧殆尽甘やかな囁き一つ一抹甜言蜜语产生的效果穢れ無き少女には毒对纯情少女来说无异于毒惑戸惑い抗うだけ不甘困惑随之作出的抗争憂いそして逃げられ",
               "ぬ 彼の腕到最后没办法逃脱 他的手腕情熱で焼け付く被他的热情 燃烧殆尽に満ち輝く却因此心里被忧伤充盈髪を靡かせて柔顺的秀发随风飘細い手で凪いで纤细的玉手捋发梢しなやかに舞い踊り轻盈地跃动 灵快地舞蹈鈴を鳴らし揺れる脚踝上的银铃作响轻摇妖精は哀を食んで歌うよ伴舞的妖精在歌唱 把哀伤都吃掉炎蒔いて 笑み浮かべる播撒下了火种 脸上浮现微笑長い睫毛 伏せ长长的睫毛齐低垂細い足首に闪闪的饰物纤足缀金のアンクレット金光照亮了漆黑的夜晚月の光が満ちる皎洁的月光来相会妖精は羽を交わし歌うよ伴唱的妖精在舞步中 把羽翼交汇炎焦れて捕まえる世界ごと就让火焰燃烧 连同我与这被捕获的世界",
               "真夏の夜の荒地に在盛夏之夜的荒凉地方紅い炎燃え盛る一朵鲜红的火焰熊熊绽放薄絹を身に纏い轻盈的薄绢盘绕于精在歌唱 把哀伤都吃掉炎蒔いて 導いて彼方へと播撒焰种 其的方向 向远方引导熱く惹かれあう 纏い轻盈的薄绢盘绕于身上祈りを捧げる少女虔诚的少女用灵魂在祈望願いは戦場へと那愿望是にはいらない其他的事 不曾奢望涙を届けて欲しい只想要让泪水传达给神明髪を靡かせて柔顺的 征战沙场的他旅立つ彼の無事を旅程一切顺利人安康他秀发随风飘細い手で凪いで纤细的玉手捋发梢しなやかに舞い踊り轻盈地跃动 灵快地舞蹈鈴を鳴らし 揺れる脚踝上的银铃作响轻摇妖精は哀を食んで歌うよ伴舞的妖彼の手へ炽热的吸引两人双手相交もう一度 逢わせて就希望再次 重回怀抱流れた星を数え用心数流星蜥蜴的红舌仿佛在流淌少女へ恋に堕ちた 炎統べる王は言う坠入爱河 的少女尝试去 祈求火炎之王的威光我が為 踊れば 望みを聞き届けよう王对她说 “所有愿望 你的一舞便可以全部抵偿”長い睫毛 伏せ长长的睫毛齐低垂"
           ],
               weather:"el-icon-xiaoxue",
               weather_detail:"雪",
               mood:"el-icon-kaixin",
               mood_detail:"开心",
               like:0
           },
           {
               id:2,
               head:"",
               content:"",
               weather:"",
               weather_detail:'',
               mood:"",
               mood_detail:'',
               like:0
           },
           {
               id:3,
               head:"",
               content:"",
               weather:"",
               weather_detail:'',
               mood:"",
               mood_detail:'',
               like:0
           },
           {
               id:4,
               head:"",
               content:"",
               weather:"",
               weather_detail:'',
               mood:"",
               mood_detail:'',
               like:0
           },
           {
               id:5,
               head:"",
               content:"",
               weather:"",
               weather_detail:'',
               mood:"",
               mood_detail:'',
               like:0
           },
           {
               id:6,
               head:"",
               content:"",
               weather:"",
               weather_detail:'',
               mood:"",
               mood_detail:'',
               like:0
           }
         ]
      }, 
    //   2020
    {
        year:'2020',
        diary:[{
           id:1,
           head:"",
           content:["真夏の夜の荒地に在盛夏之夜的荒凉地方紅い炎燃え盛る一朵鲜红的火焰熊熊绽放薄絹を身に細い足首划过的数量運命の行方占う可以占卜命运行进的方向白い肌に走るは在白皙的肌肤上游荡火のトカゲの紅い舌火に闪闪的饰物纤足缀金のアンクレット金光照亮了漆黑的夜晚月の光が満ちる皎洁的月光来相会妖精は羽を交わし歌うよ伴唱的妖精在舞步中 把羽翼交汇炎焦れて捕まえる世界ごと就让火焰燃烧 连同我与这被捕获的世界そして逃げられぬ 彼の腕到最后没办法逃脱 他的手腕情熱で焼け付く被他的热情 燃烧殆尽甘やかな囁き一つ一抹甜言蜜语产生的效果穢れ無き少女には毒对纯情少女来说无异于毒惑戸惑い抗うだけ不甘困惑随之作出的抗争憂いそして逃げられ",
           "ぬ 彼の腕到最后没办法逃脱 他的手腕情熱で焼け付く被他的热情 燃烧殆尽に満ち輝く却因此心里被忧伤充盈髪を靡かせて柔顺的秀发随风飘細い手で凪いで纤细的玉手捋发梢しなやかに舞い踊り轻盈地跃动 灵快地舞蹈鈴を鳴らし揺れる脚踝上的银铃作响轻摇妖精は哀を食んで歌うよ伴舞的妖精在歌唱 把哀伤都吃掉炎蒔いて 笑み浮かべる播撒下了火种 脸上浮现微笑長い睫毛 伏せ长长的睫毛齐低垂細い足首に闪闪的饰物纤足缀金のアンクレット金光照亮了漆黑的夜晚月の光が満ちる皎洁的月光来相会妖精は羽を交わし歌うよ伴唱的妖精在舞步中 把羽翼交汇炎焦れて捕まえる世界ごと就让火焰燃烧 连同我与这被捕获的世界",
           "真夏の夜の荒地に在盛夏之夜的荒凉地方紅い炎燃え盛る一朵鲜红的火焰熊熊绽放薄絹を身に纏い轻盈的薄绢盘绕于精在歌唱 把哀伤都吃掉炎蒔いて 導いて彼方へと播撒焰种 其的方向 向远方引导熱く惹かれあう 纏い轻盈的薄绢盘绕于身上祈りを捧げる少女虔诚的少女用灵魂在祈望願いは戦場へと那愿望是にはいらない其他的事 不曾奢望涙を届けて欲しい只想要让泪水传达给神明髪を靡かせて柔顺的 征战沙场的他旅立つ彼の無事を旅程一切顺利人安康他秀发随风飘細い手で凪いで纤细的玉手捋发梢しなやかに舞い踊り轻盈地跃动 灵快地舞蹈鈴を鳴らし 揺れる脚踝上的银铃作响轻摇妖精は哀を食んで歌うよ伴舞的妖彼の手へ炽热的吸引两人双手相交もう一度 逢わせて就希望再次 重回怀抱流れた星を数え用心数流星蜥蜴的红舌仿佛在流淌少女へ恋に堕ちた 炎統べる王は言う坠入爱河 的少女尝试去 祈求火炎之王的威光我が為 踊れば 望みを聞き届けよう王对她说 “所有愿望 你的一舞便可以全部抵偿”長い睫毛 伏せ长长的睫毛齐低垂"
       ],
           weather:"el-icon-xiaoxue",
           weather_detail:"雪",
           mood:"el-icon-kaixin",
           mood_detail:"开心",
           like:0
       },
       {
           id:2,
           head:"",
           content:"",
           weather:"",
           weather_detail:'',
           mood:"",
           mood_detail:'',
           like:0
       },
       {
           id:3,
           head:"",
           content:"",
           weather:"",
           weather_detail:'',
           mood:"",
           mood_detail:'',
           like:0
       },
       {
           id:4,
           head:"",
           content:"",
           weather:"",
           weather_detail:'',
           mood:"",
           mood_detail:'',
           like:0
       },
       {
           id:5,
           head:"",
           content:"",
           weather:"",
           weather_detail:'',
           mood:"",
           mood_detail:'',
           like:0
       }, 
       {
           id:6,
           head:"",
           content:"",
           weather:"",
           weather_detail:'',
           mood:"",
           mood_detail:'',
           like:0
       }
     ]
  }, 
    //   2019
    {
        year:'2019',
        diary:[{
           id:1,
           head:"",
           content:["真夏の夜の荒地に在盛夏之夜的荒凉地方紅い炎燃え盛る一朵鲜红的火焰熊熊绽放薄絹を身に細い足首划过的数量運命の行方占う可以占卜命运行进的方向白い肌に走るは在白皙的肌肤上游荡火のトカゲの紅い舌火に闪闪的饰物纤足缀金のアンクレット金光照亮了漆黑的夜晚月の光が満ちる皎洁的月光来相会妖精は羽を交わし歌うよ伴唱的妖精在舞步中 把羽翼交汇炎焦れて捕まえる世界ごと就让火焰燃烧 连同我与这被捕获的世界そして逃げられぬ 彼の腕到最后没办法逃脱 他的手腕情熱で焼け付く被他的热情 燃烧殆尽甘やかな囁き一つ一抹甜言蜜语产生的效果穢れ無き少女には毒对纯情少女来说无异于毒惑戸惑い抗うだけ不甘困惑随之作出的抗争憂いそして逃げられ",
           "ぬ 彼の腕到最后没办法逃脱 他的手腕情熱で焼け付く被他的热情 燃烧殆尽に満ち輝く却因此心里被忧伤充盈髪を靡かせて柔顺的秀发随风飘細い手で凪いで纤细的玉手捋发梢しなやかに舞い踊り轻盈地跃动 灵快地舞蹈鈴を鳴らし揺れる脚踝上的银铃作响轻摇妖精は哀を食んで歌うよ伴舞的妖精在歌唱 把哀伤都吃掉炎蒔いて 笑み浮かべる播撒下了火种 脸上浮现微笑長い睫毛 伏せ长长的睫毛齐低垂細い足首に闪闪的饰物纤足缀金のアンクレット金光照亮了漆黑的夜晚月の光が満ちる皎洁的月光来相会妖精は羽を交わし歌うよ伴唱的妖精在舞步中 把羽翼交汇炎焦れて捕まえる世界ごと就让火焰燃烧 连同我与这被捕获的世界",
           "真夏の夜の荒地に在盛夏之夜的荒凉地方紅い炎燃え盛る一朵鲜红的火焰熊熊绽放薄絹を身に纏い轻盈的薄绢盘绕于精在歌唱 把哀伤都吃掉炎蒔いて 導いて彼方へと播撒焰种 其的方向 向远方引导熱く惹かれあう 纏い轻盈的薄绢盘绕于身上祈りを捧げる少女虔诚的少女用灵魂在祈望願いは戦場へと那愿望是にはいらない其他的事 不曾奢望涙を届けて欲しい只想要让泪水传达给神明髪を靡かせて柔顺的 征战沙场的他旅立つ彼の無事を旅程一切顺利人安康他秀发随风飘細い手で凪いで纤细的玉手捋发梢しなやかに舞い踊り轻盈地跃动 灵快地舞蹈鈴を鳴らし 揺れる脚踝上的银铃作响轻摇妖精は哀を食んで歌うよ伴舞的妖彼の手へ炽热的吸引两人双手相交もう一度 逢わせて就希望再次 重回怀抱流れた星を数え用心数流星蜥蜴的红舌仿佛在流淌少女へ恋に堕ちた 炎統べる王は言う坠入爱河 的少女尝试去 祈求火炎之王的威光我が為 踊れば 望みを聞き届けよう王对她说 “所有愿望 你的一舞便可以全部抵偿”長い睫毛 伏せ长长的睫毛齐低垂"
       ],
       weather:"el-icon-xiaoxue",
       weather_detail:"雪",
       mood:"el-icon-kaixin",
       mood_detail:"开心",
       like:0
       },
       {
           id:2,
           head:"",
           content:"",
           weather:"",
           weather_detail:'',
           mood:"",
           mood_detail:'',
           like:0
       },
       {
           id:3,
           head:"",
           content:"",
           weather:"",
           weather_detail:'',
           mood:"",
           mood_detail:'',
           like:0
       },
       {
           id:4,
           head:"",
           content:"",
           weather:"",
           weather_detail:'',
           mood:"",
           mood_detail:'',
           like:0
       },
       {
           id:5,
           head:"",
           content:"",
           weather:"",
           weather_detail:'',
           mood:"",
           mood_detail:'',
           like:0
       },
       {
           id:6,
           head:"",
           content:"",
           weather:"",
           weather_detail:'',
           mood:"",
           mood_detail:'',
           like:0
       }
     ]
    }, 
    // 2018
    {
        year:'2018',
        diary:[{
           id:1,
           head:"",
           content:["真夏の夜の荒地に在盛夏之夜的荒凉地方紅い炎燃え盛る一朵鲜红的火焰熊熊绽放薄絹を身に細い足首划过的数量運命の行方占う可以占卜命运行进的方向白い肌に走るは在白皙的肌肤上游荡火のトカゲの紅い舌火に闪闪的饰物纤足缀金のアンクレット金光照亮了漆黑的夜晚月の光が満ちる皎洁的月光来相会妖精は羽を交わし歌うよ伴唱的妖精在舞步中 把羽翼交汇炎焦れて捕まえる世界ごと就让火焰燃烧 连同我与这被捕获的世界そして逃げられぬ 彼の腕到最后没办法逃脱 他的手腕情熱で焼け付く被他的热情 燃烧殆尽甘やかな囁き一つ一抹甜言蜜语产生的效果穢れ無き少女には毒对纯情少女来说无异于毒惑戸惑い抗うだけ不甘困惑随之作出的抗争憂いそして逃げられ",
           "ぬ 彼の腕到最后没办法逃脱 他的手腕情熱で焼け付く被他的热情 燃烧殆尽に満ち輝く却因此心里被忧伤充盈髪を靡かせて柔顺的秀发随风飘細い手で凪いで纤细的玉手捋发梢しなやかに舞い踊り轻盈地跃动 灵快地舞蹈鈴を鳴らし揺れる脚踝上的银铃作响轻摇妖精は哀を食んで歌うよ伴舞的妖精在歌唱 把哀伤都吃掉炎蒔いて 笑み浮かべる播撒下了火种 脸上浮现微笑長い睫毛 伏せ长长的睫毛齐低垂細い足首に闪闪的饰物纤足缀金のアンクレット金光照亮了漆黑的夜晚月の光が満ちる皎洁的月光来相会妖精は羽を交わし歌うよ伴唱的妖精在舞步中 把羽翼交汇炎焦れて捕まえる世界ごと就让火焰燃烧 连同我与这被捕获的世界",
           "真夏の夜の荒地に在盛夏之夜的荒凉地方紅い炎燃え盛る一朵鲜红的火焰熊熊绽放薄絹を身に纏い轻盈的薄绢盘绕于精在歌唱 把哀伤都吃掉炎蒔いて 導いて彼方へと播撒焰种 其的方向 向远方引导熱く惹かれあう 纏い轻盈的薄绢盘绕于身上祈りを捧げる少女虔诚的少女用灵魂在祈望願いは戦場へと那愿望是にはいらない其他的事 不曾奢望涙を届けて欲しい只想要让泪水传达给神明髪を靡かせて柔顺的 征战沙场的他旅立つ彼の無事を旅程一切顺利人安康他秀发随风飘細い手で凪いで纤细的玉手捋发梢しなやかに舞い踊り轻盈地跃动 灵快地舞蹈鈴を鳴らし 揺れる脚踝上的银铃作响轻摇妖精は哀を食んで歌うよ伴舞的妖彼の手へ炽热的吸引两人双手相交もう一度 逢わせて就希望再次 重回怀抱流れた星を数え用心数流星蜥蜴的红舌仿佛在流淌少女へ恋に堕ちた 炎統べる王は言う坠入爱河 的少女尝试去 祈求火炎之王的威光我が為 踊れば 望みを聞き届けよう王对她说 “所有愿望 你的一舞便可以全部抵偿”長い睫毛 伏せ长长的睫毛齐低垂"
       ],
           weather:"el-icon-xiaoxue",
           weather_detail:"雪",
           mood:"el-icon-kaixin",
           mood_detail:"开心",
           like:0
       },
       {
           id:2,
           head:"",
           content:"",
           weather:"",
           weather_detail:'',
           mood:"",
           mood_detail:'',
           like:0
       },
       {
           id:3,
           head:"",
           content:"",
           weather:"",
           weather_detail:'',
           mood:"",
           mood_detail:'',
           like:0
       },
       {
           id:4,
           head:"",
           content:"",
           weather:"",
           weather_detail:'',
           mood:"",
           mood_detail:'',
           like:0
       },
       {
           id:5,
           head:"",
           content:"",
           weather:"",
           weather_detail:'',
           mood:"",
           mood_detail:'',
           like:0
       },
       {
           id:6,
           head:"",
           content:"",
           weather:"",
           weather_detail:'',
           mood:"",
           mood_detail:'',
           like:0
       }
     ]
    },    
],

    // 相册部分
       album:[
        {
            year:'2022',
            content:[
                {
                  id:0  ,
                  url:'src/assets/4.jpg',
                  srcList:['src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg',]
                },
                {
                  id:1,
                  url:'src/assets/4.jpg',
                  srcList:['src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg',]
                },
                {
                  id:2,
                  url:'src/assets/4.jpg',
                  srcList:['src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg',]
                },
                {
                  id:3,
                  url:'src/assets/4.jpg',
                  srcList:['src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg',]
                },
            ],
            
        },


        {
            year:'2021',
            content:[
                {
                  id:0  ,
                  url:'src/assets/4.jpg',
                  srcList:['src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg',]
                }
            ],
            srcList:[]
        },


        {
            year:'2020',
            content:[
                {
                  id:0  ,
                  url:'src/assets/4.jpg',
                  srcList:['src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg',]
                }
            ],
            srcList:[]
        },


        {
            year:'2019',
            content:[
                {
                  id:0  ,
                  url:'src/assets/4.jpg',
                  srcList:['src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg',]
                }
            ],
            srcList:[]
        },


        {
            year:'2018',
            content:[
                {
                  id:0  ,
                  url:'src/assets/4.jpg',
                  srcList:['src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg','src/assets/4.jpg',]
                }
            ],
            srcList:[]
        },

       ],





      }
    },


    
   

    mutations: { 
},

    getters:{
    }
}
)
